Autodesk.Revit.TransformAPIUtils.CreateReflection(Autodesk.Revit.DB.Plane)
Creates a transform that represents a reflection across the given plane.
plane:
The plane.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.TransformAPIUtils.CreateRotationAtPoint(Autodesk.Revit.DB.XYZ,System.Double,Autodesk.Revit.DB.XYZ)
Creates a transform that represents a rotation about the given axis at the specified point.
axis:
The rotation axis.
angle:
The angle.
origin:
The origin point.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axis has zero length.
Since:
2014

Autodesk.Revit.TransformAPIUtils.CreateRotation(Autodesk.Revit.DB.XYZ,System.Double)
Creates a transform that represents a rotation about the given axis at (0, 0, 0).
axis:
The rotation axis.
angle:
The angle.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentException:
The given value for angle is not finite
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
axis has zero length.
Since:
2014

Autodesk.Revit.TransformAPIUtils.CreateTranslation(Autodesk.Revit.DB.XYZ)
Creates a transform that represents a translation via the specified vector.
vector:
The translation vector.
Returns:
The new transform.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2014

Autodesk.Revit.TransformAPIUtils.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.TransformAPIUtils
Contains native implementations of transform related functions exposed to API.
Remarks:
All of the static methods contained within logically belong within the API in Transform.
The internal API wrappers are called directly by the related public API methods.
Since:
2014